{
  "_num_labels": 5,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-JALAN",
    "2": "B-KECAMATAN",
    "3": "B-KELURAHAN",
    "4": "B-KODEPOS",
    "5": "B-KOTA",
    "6": "B-PROVINSI",
    "7": "B-RT",
    "8": "B-RW",
    "9": "I-JALAN",
    "10": "I-KECAMATAN",
    "11": "I-KELURAHAN",
    "12": "I-KOTA",
    "13": "I-PROVINSI",
    "14": "I-RT",
    "15": "I-RW"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-JALAN": 1,
    "B-KECAMATAN": 2,
    "B-KELURAHAN": 3,
    "B-KODEPOS": 4,
    "B-KOTA": 5,
    "B-PROVINSI": 6,
    "B-RT": 7,
    "B-RW": 8,
    "I-JALAN": 9,
    "I-KECAMATAN": 10,
    "I-KELURAHAN": 11,
    "I-KOTA": 12,
    "I-PROVINSI": 13,
    "I-RT": 14,
    "I-RW": 15,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 50000
}
